In [ ]:
import pandas as pd

In [ ]:
df_player = [
  [1, "Cody Bellinger", 3, "OF"]
  , [2, "Mookie Betts", 3, "OF"]
  , [3, "Nolan Arenado", 2, "3B"]
  , [4, "Trevor Story", 2, "SS"]
  , [5, "Fernando Tatis Jr.", 4, "SS"]
  , [6, "Buster Posey", 5, "C"]
  , [7, "Starling Marte", 1, "OF"]
  , [8, "Manny Machado", 4, "3B"]
]
player_columns = ["Id", "Name", "TeamId", "Position"]
players = pd.DataFrame(data=df_player, columns=player_columns)

In [ ]:
players

   Id                Name  TeamId Position
0   1      Cody Bellinger       3       OF
1   2        Mookie Betts       3       OF
2   3       Nolan Arenado       2       3B
3   4        Trevor Story       2       SS
4   5  Fernando Tatis Jr.       4       SS
5   6        Buster Posey       5        C
6   7      Starling Marte       1       OF
7   8       Manny Machado       4       3B

In [ ]:
players.rename({"TeamId":"Team"},axis=1)

   Id                Name  Team Position
0   1      Cody Bellinger     3       OF
1   2        Mookie Betts     3       OF
2   3       Nolan Arenado     2       3B
3   4        Trevor Story     2       SS
4   5  Fernando Tatis Jr.     4       SS
5   6        Buster Posey     5        C
6   7      Starling Marte     1       OF
7   8       Manny Machado     4       3B

In [ ]:
players.rename({7:8},axis=0)

   Id                Name  TeamId Position
0   1      Cody Bellinger       3       OF
1   2        Mookie Betts       3       OF
2   3       Nolan Arenado       2       3B
3   4        Trevor Story       2       SS
4   5  Fernando Tatis Jr.       4       SS
5   6        Buster Posey       5        C
6   7      Starling Marte       1       OF
8   8       Manny Machado       4       3B

In [ ]:
players.set_index("Name", inplace=True)

In [ ]:
players

   Id                Name  TeamId Position
0   1      Cody Bellinger       3       OF
1   2        Mookie Betts       3       OF
2   3       Nolan Arenado       2       3B
3   4        Trevor Story       2       SS
4   5  Fernando Tatis Jr.       4       SS
5   6        Buster Posey       5        C
6   7      Starling Marte       1       OF
7   8       Manny Machado       4       3B

In [ ]:
players2 = players.copy()

In [ ]:
del players["Name"]

In [ ]:
players

   Id  TeamId Position
0   1       3       OF
1   2       3       OF
2   3       2       3B
3   4       2       SS
4   5       4       SS
5   6       5        C
6   7       1       OF
7   8       4       3B

In [ ]:
players2

   Id                Name  TeamId Position
0   1      Cody Bellinger       3       OF
1   2        Mookie Betts       3       OF
2   3       Nolan Arenado       2       3B
3   4        Trevor Story       2       SS
4   5  Fernando Tatis Jr.       4       SS
5   6        Buster Posey       5        C
6   7      Starling Marte       1       OF
7   8       Manny Machado       4       3B

In [ ]:
players2["Name"]

0        Cody Bellinger
1          Mookie Betts
2         Nolan Arenado
3          Trevor Story
4    Fernando Tatis Jr.
5          Buster Posey
6        Starling Marte
7         Manny Machado
Name: Name, dtype: object

In [ ]:
s = pd.Series(["8", 6, "7.5", 3, "0.9"])

In [ ]:
s = pd.to_numeric(s)

In [ ]:
s.round()

0    8.0
1    6.0
2    8.0
3    3.0
4    1.0
dtype: float64

In [ ]:
a = [['a', '1.2', '4.2'], ['b', '70', '0.03'], ['x', '5', '0']]
df = pd.DataFrame(a)

In [ ]:
df

   0    1     2
0  a  1.2   4.2
1  b   70  0.03
2  x    5     0

In [ ]:
pd.to_numeric(df[1]).round().astype(int)

0     1
1    70
2     5
Name: 1, dtype: int64

In [ ]:
players

   Id  TeamId Position
0   1       3       OF
1   2       3       OF
2   3       2       3B
3   4       2       SS
4   5       4       SS
5   6       5        C
6   7       1       OF
7   8       4       3B

In [ ]:
players.drop("Id", axis=1, inplace=True)

In [ ]:
players

   TeamId Position
0       3       OF
1       3       OF
2       2       3B
3       2       SS
4       4       SS
5       5        C
6       1       OF
7       4       3B

In [ ]:
players.drop(3, axis=0, inplace=True)

In [ ]:
players

   TeamId Position
0       3       OF
1       3       OF
2       2       3B
4       4       SS
5       5        C
6       1       OF
7       4       3B

In [ ]:
dict2 = {'First Score':[100, None, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score':[np.nan, 40, 80, 98]}

In [ ]:
import numpy as np

In [ ]:
df = pd.DataFrame(dict2)

In [ ]:
df.isnull().sum()

First Score     2
Second Score    1
Third Score     1
dtype: int64

In [ ]:
df

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1          NaN          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0

In [ ]:
df.isnull().sum()

First Score     2
Second Score    1
Third Score     1
dtype: int64

In [ ]:
df

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1          NaN          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0